Revit 2026 API

# ConnectionInputPointInfoRestrictionType Property

---

A type of input point restriction.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RestrictionType { get; set; }
```
```vb
Public Property RestrictionType As String
	Get
	Set
```
```cpp
public:
property String^ RestrictionType {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RestrictionType : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ConnectionInputPointInfo Class

Autodesk.Revit.DB.Structure Namespace